PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p16lf1788.inc
;----- PSMC3ASDC Bits -----------------------------------------------------
P3ASDOV          EQU  H'0000'
P3ARSEN          EQU  H'0005'
P3ASDEN          EQU  H'0006'
P3ASE            EQU  H'0007'


;----- PSMC3ASDL Bits -----------------------------------------------------
P3ASDLA          EQU  H'0000'
P3ASDLB          EQU  H'0001'


;----- PSMC3ASDS Bits -----------------------------------------------------
P3ASDSC1         EQU  H'0001'
P3ASDSC2         EQU  H'0002'
P3ASDSC3         EQU  H'0003'
P3ASDSC4         EQU  H'0004'
P3ASDSIN         EQU  H'0007'


;----- PSMC3INT Bits -----------------------------------------------------
P3TPRIF          EQU  H'0000'
P3TDCIF          EQU  H'0001'
P3TPHIF          EQU  H'0002'
P3TOVIF          EQU  H'0003'
P3TPRIE          EQU  H'0004'
P3TDCIE          EQU  H'0005'
P3TPHIE          EQU  H'0006'
P3TOVIE          EQU  H'0007'


;----- PSMC3PHL Bits -----------------------------------------------------
PSMC3PH0         EQU  H'0000'
PSMC3PH1         EQU  H'0001'
PSMC3PH2         EQU  H'0002'
PSMC3PH3         EQU  H'0003'
PSMC3PH4         EQU  H'0004'
PSMC3PH5         EQU  H'0005'
PSMC3PH6         EQU  H'0006'
PSMC3PH7         EQU  H'0007'


;----- PSMC3PHH Bits -----------------------------------------------------
PSMC3PH8         EQU  H'0000'
PSMC3PH9         EQU  H'0001'
PSMC3PH10        EQU  H'0002'
PSMC3PH11        EQU  H'0003'
PSMC3PH12        EQU  H'0004'
PSMC3PH13        EQU  H'0005'
PSMC3PH14        EQU  H'0006'
PSMC3PH15        EQU  H'0007'


;----- PSMC3DCL Bits -----------------------------------------------------
PSMC3DC0         EQU  H'0000'
PSMC3DC1         EQU  H'0001'
PSMC3DC2         EQU  H'0002'
PSMC3DC3         EQU  H'0003'
PSMC3DC4         EQU  H'0004'
PSMC3DC5         EQU  H'0005'
PSMC3DC6         EQU  H'0006'
PSMC3DC7         EQU  H'0007'


;----- PSMC3DCH Bits -----------------------------------------------------
PSMC3DC8         EQU  H'0000'
PSMC3DC9         EQU  H'0001'
PSMC3DC10        EQU  H'0002'
PSMC3DC11        EQU  H'0003'
PSMC3DC12        EQU  H'0004'
PSMC3DC13        EQU  H'0005'
PSMC3DC14        EQU  H'0006'
PSMC3DC15        EQU  H'0007'


;----- PSMC3PRL Bits -----------------------------------------------------
PSMC3PR0         EQU  H'0000'
PSMC3PR1         EQU  H'0001'
PSMC3PR2         EQU  H'0002'
PSMC3PR3         EQU  H'0003'
PSMC3PR4         EQU  H'0004'
PSMC3PR5         EQU  H'0005'
PSMC3PR6         EQU  H'0006'
PSMC3PR7         EQU  H'0007'


;----- PSMC3PRH Bits -----------------------------------------------------
PSMC3PR8         EQU  H'0000'
PSMC3PR9         EQU  H'0001'
PSMC3PR10        EQU  H'0002'
PSMC3PR11        EQU  H'0003'
PSMC3PR12        EQU  H'0004'
PSMC3PR13        EQU  H'0005'
PSMC3PR14        EQU  H'0006'
PSMC3PR15        EQU  H'0007'


;----- PSMC3TMRL Bits -----------------------------------------------------
PSMC3TMR0        EQU  H'0000'
PSMC3TMR1        EQU  H'0001'
PSMC3TMR2        EQU  H'0002'
PSMC3TMR3        EQU  H'0003'
PSMC3TMR4        EQU  H'0004'
PSMC3TMR5        EQU  H'0005'
PSMC3TMR6        EQU  H'0006'
PSMC3TMR7        EQU  H'0007'


;----- PSMC3TMRH Bits -----------------------------------------------------
PSMC3TMR8        EQU  H'0000'
PSMC3TMR9        EQU  H'0001'
PSMC3TMR10       EQU  H'0002'
PSMC3TMR11       EQU  H'0003'
PSMC3TMR12       EQU  H'0004'
PSMC3TMR13       EQU  H'0005'
PSMC3TMR14       EQU  H'0006'
PSMC3TMR15       EQU  H'0007'


;----- PSMC3DBR Bits -----------------------------------------------------
PSMC3DBR0        EQU  H'0000'
PSMC3DBR1        EQU  H'0001'
PSMC3DBR2        EQU  H'0002'
PSMC3DBR3        EQU  H'0003'
PSMC3DBR4        EQU  H'0004'
PSMC3DBR5        EQU  H'0005'
PSMC3DBR6        EQU  H'0006'
PSMC3DBR7        EQU  H'0007'


;----- PSMC3DBF Bits -----------------------------------------------------
PSMC3DBF0        EQU  H'0000'
PSMC3DBF1        EQU  H'0001'
PSMC3DBF2        EQU  H'0002'
PSMC3DBF3        EQU  H'0003'
PSMC3DBF4        EQU  H'0004'
PSMC3DBF5        EQU  H'0005'
PSMC3DBF6        EQU  H'0006'
PSMC3DBF7        EQU  H'0007'


;----- PSMC3BLKR Bits -----------------------------------------------------
PSMC3BLKR0       EQU  H'0000'
PSMC3BLKR1       EQU  H'0001'
PSMC3BLKR2       EQU  H'0002'
PSMC3BLKR3       EQU  H'0003'
PSMC3BLKR4       EQU  H'0004'
PSMC3BLKR5       EQU  H'0005'
PSMC3BLKR6       EQU  H'0006'
PSMC3BLKR7       EQU  H'0007'


;----- PSMC3BLKF Bits -----------------------------------------------------
PSMC3BLKF0       EQU  H'0000'
PSMC3BLKF1       EQU  H'0001'
PSMC3BLKF2       EQU  H'0002'
PSMC3BLKF3       EQU  H'0003'
PSMC3BLKF4       EQU  H'0004'
PSMC3BLKF5       EQU  H'0005'
PSMC3BLKF6       EQU  H'0006'
PSMC3BLKF7       EQU  H'0007'


;----- PSMC3FFA Bits -----------------------------------------------------
PSMC3FFA0        EQU  H'0000'
PSMC3FFA1        EQU  H'0001'
PSMC3FFA2        EQU  H'0002'
PSMC3FFA3        EQU  H'0003'


;----- PSMC3STR0 Bits -----------------------------------------------------
P3STRA           EQU  H'0000'
P3STRB           EQU  H'0001'


;----- PSMC3STR1 Bits -----------------------------------------------------
P3HSMEN          EQU  H'0000'
P3LSMEN          EQU  H'0001'
P3SSYNC          EQU  H'0007'


;----- PSMC4CON Bits -----------------------------------------------------
P4DBRE           EQU  H'0004'
P4DBFE           EQU  H'0005'
PSMC4LD          EQU  H'0006'
PSMC4EN          EQU  H'0007'

P4MODE0          EQU  H'0000'
P4MODE1          EQU  H'0001'
P4MODE2          EQU  H'0002'
P4MODE3          EQU  H'0003'


;----- PSMC4MDL Bits -----------------------------------------------------
P4MDLBIT         EQU  H'0005'
P4MDLPOL         EQU  H'0006'
P4MDLEN          EQU  H'0007'

P4MSRC0          EQU  H'0000'
P4MSRC1          EQU  H'0001'
P4MSRC2          EQU  H'0002'
P4MSRC3          EQU  H'0003'


;----- PSMC4SYNC Bits -----------------------------------------------------
P4SYNC0          EQU  H'0000'
P4SYNC1          EQU  H'0001'
P4SYNC2          EQU  H'0002'
P4DCPOL          EQU  H'0005'
P4PRPOL          EQU  H'0006'
P4POFST          EQU  H'0007'


;----- PSMC4CLK Bits -----------------------------------------------------
P4CSRC0          EQU  H'0000'
P4CSRC1          EQU  H'0001'
P4CPRE0          EQU  H'0004'
P4CPRE1          EQU  H'0005'



;----- PSMC4OEN Bits -----------------------------------------------------
P4OEA            EQU  H'0000'
P4OEB            EQU  H'0001'


;----- PSMC4POL Bits -----------------------------------------------------
P4POLA           EQU  H'0000'
P4POLB           EQU  H'0001'
P4INPOL          EQU  H'0006'


;----- PSMC4BLNK Bits -----------------------------------------------------
P4REBM0          EQU  H'0000'
P4REBM1          EQU  H'0001'
P4FEBM0          EQU  H'0004'
P4FEBM1          EQU  H'0005'


;----- PSMC4REBS Bits -----------------------------------------------------
P4REBSC1         EQU  H'0001'
P4REBSC2         EQU  H'0002'
P4REBSC3         EQU  H'0003'
P4REBSC4         EQU  H'0004'
P4REBSIN         EQU  H'0007'


;----- PSMC4FEBS Bits -----------------------------------------------------
P4FEBSC1         EQU  H'0001'
P4FEBSC2         EQU  H'0002'
P4FEBSC3         EQU  H'0003'
P4FEBSC4         EQU  H'0004'
P4FEBSIN         EQU  H'0007'


;----- PSMC4PHS Bits -----------------------------------------------------
P4PHST           EQU  H'0000'
P4PHSC1          EQU  H'0001'
P4PHSC2          EQU  H'0002'
P4PHSC3          EQU  H'0003'
P4PHSC4          EQU  H'0004'
P4PHSIN          EQU  H'0007'


;----- PSMC4DCS Bits -----------------------------------------------------
P4DCST           EQU  H'0000'
P4DCSC1          EQU  H'0001'
P4DCSC2          EQU  H'0002'
P4DCSC3          EQU  H'0003'
P4DCSC4          EQU  H'0004'
P4DCSIN          EQU  H'0007'


;----- PSMC4PRS Bits -----------------------------------------------------
P4PRST           EQU  H'0000'
P4PRSC1          EQU  H'0001'
P4PRSC2          EQU  H'0002'
P4PRSC3          EQU  H'0003'
P4PRSC4          EQU  H'0004'
P4PRSIN          EQU  H'0007'


;----- PSMC4ASDC Bits -----------------------------------------------------
P4ASDOV          EQU  H'0000'
P4ARSEN          EQU  H'0005'
P4ASDEN          EQU  H'0006'
P4ASE            EQU  H'0007'


;----- PSMC4ASDL Bits -----------------------------------------------------
P4ASDLA          EQU  H'0000'
P4ASDLB          EQU  H'0001'


;----- PSMC4ASDS Bits -----------------------------------------------------
P4ASDSC1         EQU  H'0001'
P4ASDSC2         EQU  H'0002'
P4ASDSC3         EQU  H'0003'
P4ASDSC4         EQU  H'0004'
P4ASDSIN         EQU  H'0007'


;----- PSMC4INT Bits -----------------------------------------------------
P4TPRIF          EQU  H'0000'
P4TDCIF          EQU  H'0001'
P4TPHIF          EQU  H'0002'
P4TOVIF          EQU  H'0003'
P4TPRIE          EQU  H'0004'
P4TDCIE          EQU  H'0005'
P4TPHIE          EQU  H'0006'
P4TOVIE          EQU  H'0007'


;----- PSMC4PHL Bits -----------------------------------------------------
PSMC4PH0         EQU  H'0000'
PSMC4PH1         EQU  H'0001'
PSMC4PH2         EQU  H'0002'
PSMC4PH3         EQU  H'0003'
PSMC4PH4         EQU  H'0004'
PSMC4PH5         EQU  H'0005'
PSMC4PH6         EQU  H'0006'
PSMC4PH7         EQU  H'0007'


